[
    {
        "name":"Why Using NEAR Tech Stack?",
        "description":"NEAR is more than just a blockchain, it is also a development environment and a platform in which to deploy and discover new applications. NEAR simplifies building Web 3 applications providing easy onboarding, high security and a seamless interaction with all chains.\r\n\r\nAccess\r\nWith NEAR, users always have the ability to locally run blockchain applications which helps assure robustness and censorship-resistance, while maintaining a user-friendly experience.\r\n\r\nSecurity\r\nThe code for Components is always on-chain, making it auditable and viewable in explorers. This enhances security, and users can locally run the full stack with confidence.\r\n\r\nComposability\r\nNEAR fosters composability by enabling developers to reuse and remix Components. Building with NEAR is extremely lightweight and easy, with the ability to deploy new front-ends for smart contracts on mainnet in less than 10 minutes.\r\n\r\nChain Agnostic Components\r\nAdditionally, NEAR Components are chain-agnostic, making it a flexible solution for developers working with different blockchains."
    },
    {
        "name":"The Pillars of NEAR Stack",
        "description":"The NEAR stack is based on three pillars:\r\n\r\nComponents: Composable frontends that solve specific problems.\r\nBlockchains: To store the component's code, as well as their assets and data.\r\nGateways: A simple way to render components anywhere."
    },
    {
        "name":"Components",
        "description":"Components are small web 3 applications (think Lido, Uniswap, Aave) that are stored entirely on-chain.\r\n\r\nDevelopers can fork these apps and compose them to create full web applications.\r\n\r\n"
    },
    {
        "name":"Blockchains",
        "description":"Components can call functions on any blockchain, with current support for all EVM chains (e.g. Polygon, zkSync) and NEAR.\r\n\r\nThe source code for the apps is on NEAR, due to it's ability to very cheaply store HTML/CSS/JS (a few cents)."
    },
    {
        "name":"Gateways",
        "description":"Gateways make locally-run, decentralized front-ends available to the masses. A gateway consists of a specially designed virtual machine that loads and runs frontends for protocols built on Ethereum, L2s, and other Layer 1s like NEAR. The code for these frontends is stored on the NEAR blockchain.\r\n\r\nExamples of gateways include near.org, bos.gg, near.social, Cantopia, and nearpad.dev."
    }
]